{"config": [{"config": {"input_layers": [["input_3", 0, 0]], "output_layers": [["embedding_3", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 50], "name": "input_3", "sparse": false, "dtype": "int32"}, "name": "input_3", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "batch_input_shape": [null, 50], "dtype": "int32", "name": "embedding_3", "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 1010343, "trainable": true, "input_length": 50, "mask_zero": false, "output_dim": 50, "embeddings_constraint": null, "embeddings_regularizer": null}, "name": "embedding_3", "class_name": "Embedding"}], "name": "model_3"}, "class_name": "Model"}, {"config": {"kernel_size": [5], "batch_input_shape": [null, null, 500], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activation": "relu", "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1], "name": "conv1d_3", "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "use_bias": true, "filters": 64, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"return_sequences": false, "trainable": true, "activation": "tanh", "unit_forget_bias": true, "dropout": 0.0, "name": "lstm_3", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "recurrent_constraint": null, "use_bias": true, "recurrent_dropout": 0.0, "implementation": 0, "activity_regularizer": null, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "units": 64, "recurrent_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "stateful": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 50, "name": "dense_5", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "units": 2, "name": "dense_6", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4"}